# YOLOv8l baseline — vanilla Ultralytics architecture, no modifications.
# Used for ablation reference. nc set dynamically by train script.

# Parameters
nc: 3
scales:
  l: [1.00, 1.00, 512]   # depth, width, max_channels

# Backbone
backbone:
  - [-1, 1, Conv,  [64, 3, 2]]       # 0  P1/2
  - [-1, 1, Conv,  [128, 3, 2]]      # 1  P2/4
  - [-1, 3, C2f,   [128, True]]
  - [-1, 1, Conv,  [256, 3, 2]]      # 3  P3/8
  - [-1, 6, C2f,   [256, True]]
  - [-1, 1, Conv,  [512, 3, 2]]      # 5  P4/16
  - [-1, 6, C2f,   [512, True]]
  - [-1, 1, Conv,  [1024, 3, 2]]     # 7  P5/32
  - [-1, 3, C2f,   [1024, True]]
  - [-1, 1, SPPF,  [1024, 5]]        # 9

# Head (PANet)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]              # 12  (P4)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]              # 15  (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]              # 18  (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]             # 21  (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]
