# YOLOv8l + CBAM attention in the PANet neck.
# CBAM is inserted after each C2f block in the head. Param budget ~0.3M.
#
# YAML convention follows Conv: `[-1, 1, CBAM, [c2, reduction, kernel_size]]`
# where c2 is the post-width-scaled channel count of the preceding C2f.
# CBAM is channel-preserving, so c2 = c1 always.

nc: 3
scales:
  l: [1.00, 1.00, 512]

backbone:
  - [-1, 1, Conv,  [64, 3, 2]]       # 0
  - [-1, 1, Conv,  [128, 3, 2]]      # 1
  - [-1, 3, C2f,   [128, True]]      # 2
  - [-1, 1, Conv,  [256, 3, 2]]      # 3
  - [-1, 6, C2f,   [256, True]]      # 4
  - [-1, 1, Conv,  [512, 3, 2]]      # 5
  - [-1, 6, C2f,   [512, True]]      # 6
  - [-1, 1, Conv,  [1024, 3, 2]]     # 7  (will be scaled to 512 at scale l)
  - [-1, 3, C2f,   [1024, True]]     # 8  (scaled to 512)
  - [-1, 1, SPPF,  [1024, 5]]        # 9  (scaled to 512)

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10
  - [[-1, 6], 1, Concat, [1]]                    # 11
  - [-1, 3, C2f, [512]]                          # 12  -> c=512
  - [-1, 1, CBAM, [512, 16, 7]]                  # 13  P4 attention

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15
  - [-1, 3, C2f, [256]]                          # 16  -> c=256
  - [-1, 1, CBAM, [256, 16, 7]]                  # 17  P3/small

  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[-1, 13], 1, Concat, [1]]                   # 19
  - [-1, 3, C2f, [512]]                          # 20  -> c=512
  - [-1, 1, CBAM, [512, 16, 7]]                  # 21

  - [-1, 1, Conv, [512, 3, 2]]                   # 22
  - [[-1, 9], 1, Concat, [1]]                    # 23
  - [-1, 3, C2f, [1024]]                         # 24  (scaled to 512)
  - [-1, 1, CBAM, [512, 16, 7]]                  # 25

  - [[17, 21, 25], 1, Detect, [nc]]
