# Combined: YOLOv8l + CBAM in PANet neck + 4th detection head at stride 4.
# Size-aware loss is applied at runtime by the train script (--variant combined).
# Param budget: baseline ~43.7M + CBAM ~0.3M + P2 head ~1.2M ≈ 45.2M.

nc: 3
scales:
  l: [1.00, 1.00, 512]

backbone:
  - [-1, 1, Conv,  [64, 3, 2]]       # 0  P1/2
  - [-1, 1, Conv,  [128, 3, 2]]      # 1  P2/4
  - [-1, 3, C2f,   [128, True]]      # 2
  - [-1, 1, Conv,  [256, 3, 2]]      # 3  P3/8
  - [-1, 6, C2f,   [256, True]]      # 4
  - [-1, 1, Conv,  [512, 3, 2]]      # 5  P4/16
  - [-1, 6, C2f,   [512, True]]      # 6
  - [-1, 1, Conv,  [1024, 3, 2]]     # 7  P5/32  (scaled to 512)
  - [-1, 3, C2f,   [1024, True]]     # 8  (scaled to 512)
  - [-1, 1, SPPF,  [1024, 5]]        # 9  (scaled to 512)

head:
  # Top-down P5→P4→P3→P2 with CBAM at each merge
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10
  - [[-1, 6], 1, Concat, [1]]                    # 11
  - [-1, 3, C2f, [512]]                          # 12  -> 512
  - [-1, 1, CBAM, [512, 16, 7]]                  # 13  P4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15
  - [-1, 3, C2f, [256]]                          # 16  -> 256
  - [-1, 1, CBAM, [256, 16, 7]]                  # 17  P3

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 18
  - [[-1, 2], 1, Concat, [1]]                    # 19  concat with backbone P2
  - [-1, 3, C2f, [128]]                          # 20  -> 128
  - [-1, 1, CBAM, [128, 16, 7]]                  # 21  P2 — detect

  # Bottom-up P2→P3→P4→P5
  - [-1, 1, Conv, [128, 3, 2]]                   # 22
  - [[-1, 17], 1, Concat, [1]]                   # 23
  - [-1, 3, C2f, [256]]                          # 24  -> 256
  - [-1, 1, CBAM, [256, 16, 7]]                  # 25  P3 — detect

  - [-1, 1, Conv, [256, 3, 2]]                   # 26
  - [[-1, 13], 1, Concat, [1]]                   # 27
  - [-1, 3, C2f, [512]]                          # 28  -> 512
  - [-1, 1, CBAM, [512, 16, 7]]                  # 29  P4 — detect

  - [-1, 1, Conv, [512, 3, 2]]                   # 30
  - [[-1, 9], 1, Concat, [1]]                    # 31
  - [-1, 3, C2f, [1024]]                         # 32  (scaled to 512)
  - [-1, 1, CBAM, [512, 16, 7]]                  # 33  P5 — detect

  - [[21, 25, 29, 33], 1, Detect, [nc]]
