# YOLOv8l + 4th detection head at stride 4 (P2/4 — 192x192 grid at 768px input).
# Targets small-object recall: distant potholes, partially-visible manholes.
# Adds ~1.2M params vs baseline. Architecture pattern follows Ultralytics'
# official `yolov8-p2.yaml` template, adapted to the L scale.

nc: 3
scales:
  l: [1.00, 1.00, 512]

backbone:
  - [-1, 1, Conv,  [64, 3, 2]]       # 0  P1/2
  - [-1, 1, Conv,  [128, 3, 2]]      # 1  P2/4
  - [-1, 3, C2f,   [128, True]]      # 2
  - [-1, 1, Conv,  [256, 3, 2]]      # 3  P3/8
  - [-1, 6, C2f,   [256, True]]      # 4
  - [-1, 1, Conv,  [512, 3, 2]]      # 5  P4/16
  - [-1, 6, C2f,   [512, True]]      # 6
  - [-1, 1, Conv,  [1024, 3, 2]]     # 7  P5/32
  - [-1, 3, C2f,   [1024, True]]     # 8
  - [-1, 1, SPPF,  [1024, 5]]        # 9

# Head: top-down P5→P4→P3→P2, then bottom-up P2→P3→P4→P5
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10
  - [[-1, 6], 1, Concat, [1]]                    # 11
  - [-1, 3, C2f, [512]]                          # 12  P4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 13
  - [[-1, 4], 1, Concat, [1]]                    # 14
  - [-1, 3, C2f, [256]]                          # 15  P3

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 16  NEW
  - [[-1, 2], 1, Concat, [1]]                    # 17  concat with backbone P2
  - [-1, 3, C2f, [128]]                          # 18  P2 (stride 4)  -- detect

  - [-1, 1, Conv, [128, 3, 2]]                   # 19
  - [[-1, 15], 1, Concat, [1]]                   # 20
  - [-1, 3, C2f, [256]]                          # 21  P3 -- detect

  - [-1, 1, Conv, [256, 3, 2]]                   # 22
  - [[-1, 12], 1, Concat, [1]]                   # 23
  - [-1, 3, C2f, [512]]                          # 24  P4 -- detect

  - [-1, 1, Conv, [512, 3, 2]]                   # 25
  - [[-1, 9], 1, Concat, [1]]                    # 26
  - [-1, 3, C2f, [1024]]                         # 27  P5 -- detect

  - [[18, 21, 24, 27], 1, Detect, [nc]]          # 4-head detect
