# =============================================================================
# Author: Rutuja Kulkarni
# RADS Layer 3 — Enhancement #2: P2 Small-Object Detection Head (YOLOv8l + P2)
# =============================================================================
# This config extends baseline YOLOv8l with a FOURTH detection head operating at
# stride 4 (the P2 feature level). At the 768px training resolution that gives a
# 192x192 prediction grid — twice as fine as the standard P3 head — so tiny road
# anomalies that occupy only a handful of pixels (distant potholes, partially
# occluded / far-off manholes) get anchor coverage they otherwise miss. This
# directly targets the RADS small-object recall problem.
#
# The backbone is unchanged from baseline; the head is rebuilt to extend the
# PANet top-down path down to P2 and then run the bottom-up path back up across
# all four scales. The wiring follows Ultralytics' official `yolov8-p2.yaml`
# template, adapted to the L (large) compound scale. Extra cost is ~1.2M params
# and noticeably more activation memory (the P2 grid is large) vs baseline.

nc: 3  # Default class count (overridden at runtime from data.yaml).
scales:
  l: [1.00, 1.00, 512]  # depth, width, max_channels — same large scale as baseline.

# Backbone — identical to baseline.yaml. Note layer 2 (P2/4) is now also tapped
# by the head below to build the new high-resolution detection branch.
backbone:
  - [-1, 1, Conv,  [64, 3, 2]]       # 0  P1/2
  - [-1, 1, Conv,  [128, 3, 2]]      # 1  P2/4
  - [-1, 3, C2f,   [128, True]]      # 2
  - [-1, 1, Conv,  [256, 3, 2]]      # 3  P3/8
  - [-1, 6, C2f,   [256, True]]      # 4
  - [-1, 1, Conv,  [512, 3, 2]]      # 5  P4/16
  - [-1, 6, C2f,   [512, True]]      # 6
  - [-1, 1, Conv,  [1024, 3, 2]]     # 7  P5/32
  - [-1, 3, C2f,   [1024, True]]     # 8
  - [-1, 1, SPPF,  [1024, 5]]        # 9

# Head — extended PANet: top-down P5→P4→P3→P2, then bottom-up P2→P3→P4→P5.
# The extra upsample/concat at layers 16-18 is the NEW P2 branch that does not
# exist in baseline; everything else mirrors baseline but with one more level.
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10
  - [[-1, 6], 1, Concat, [1]]                    # 11  fuse with backbone P4.
  - [-1, 3, C2f, [512]]                          # 12  P4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 13
  - [[-1, 4], 1, Concat, [1]]                    # 14  fuse with backbone P3.
  - [-1, 3, C2f, [256]]                          # 15  P3

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 16  NEW — upsample down to stride 4.
  - [[-1, 2], 1, Concat, [1]]                    # 17  concat with backbone P2 (layer 2).
  - [-1, 3, C2f, [128]]                          # 18  P2 (stride 4) -- small-object detect.

  - [-1, 1, Conv, [128, 3, 2]]                   # 19  bottom-up: P2 -> P3.
  - [[-1, 15], 1, Concat, [1]]                   # 20  re-fuse with top-down P3 (layer 15).
  - [-1, 3, C2f, [256]]                          # 21  P3 -- detect.

  - [-1, 1, Conv, [256, 3, 2]]                   # 22  bottom-up: P3 -> P4.
  - [[-1, 12], 1, Concat, [1]]                   # 23  re-fuse with top-down P4 (layer 12).
  - [-1, 3, C2f, [512]]                          # 24  P4 -- detect.

  - [-1, 1, Conv, [512, 3, 2]]                   # 25  bottom-up: P4 -> P5.
  - [[-1, 9], 1, Concat, [1]]                    # 26  re-fuse with SPPF output (layer 9).
  - [-1, 3, C2f, [1024]]                         # 27  P5 -- detect.

  - [[18, 21, 24, 27], 1, Detect, [nc]]          # 4-scale detect (P2/P3/P4/P5).
